app/controllers/registrations_controller.rb

    def create

        if params['user']['password'] != params['user']['password_confirmation']
            render json: {
                status: "Passwords Dont Match"
            }
         elsif User.where(email: params['user']['email']).first
            render json: {
                status: "Email Matches Current User"
            }
        elsif params['user']['password'].length < 6
            render json: {
                status: "Password Must Contain More Than 6 Characters"
            }
        else user = User.create!(
                email: params['user']['email'],
                password: params['user']['password'],
                password_confirmation: params['user']['password_confirmation']
            )
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "bore@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"