app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hack@gmail.com"], ["LIMIT", 1]]
---
    def create
        user = User
            .find_by(email: params['user']['email'])
            .try(:authenticate, params['user']['password'])